#include <stdio.h>
#include <stdlib.h>
#include <malloc.h>

#define N 10		// розмірність масиву (кількість чисел у файлі)

int main()
{
    int i;
    int *a = malloc (4);
    FILE *fp; 		// покажчик на файл
    fp = fopen ( "input.dat", "r" ); // відкриваємо файл в режимі читання
    if ( fp == NULL )   		// якщо файл не існує -
    {
        printf ( "File doesn't exist" );
        getchar();
        return 0; 		// вихід з програми (функції main())
    }
    for ( i = 0; ; i ++ ){	// якщо файл відкрився успішно -
         a = realloc(a, _msize(a) + 4);
        if ( EOF == fscanf ( fp, "%d", &a[i] ) ) // по черзі читаємо з нього числа і записуємо в масив, якщо натрапляємо на EOF (кінець файлу) або нечислові дані (не відповідають формату %d, відповідно функція fscanf() повертає кількість вдало зчитаних даних 0) -
        {
            //printf ( "Date is not enough" );
            break;	// виходимо з циклу (завершуємо читання)
        }

    }
    int M = i, b[i/2], j = 0;
    fclose ( fp ); 			// закриваємо файл
    for ( i = 0; i < M; i += 2, j++ )	// опрацьовуємо дані масиву
        b[j] = a[i] + a[i+1] ;
    fp = fopen ( "output.dat", "w" ); // відкриваємо інший  файл в режимі запису
    for ( i = 0; i < j; i ++ ) 		// по черзі записуємо в нього всі елементи масиву
        fprintf ( fp, "%d\n", b[i] ); // в стовпчик (за допомогою \n)
    fclose ( fp );			// закриваємо поточний файл
    free(a);
    return 0;
}
