#include <stdio.h>

#define N 10		// розмірність масиву (кількість чисел у файлі)

int main()
{
    int i, a[N] = {};
    FILE *fp; 		// покажчик на файл
    fp = fopen ( "input.dat", "r" ); // відкриваємо файл в режимі читання
    if ( fp == NULL )   		// якщо файл не існує -
    {
        printf ( "File doesn't exist" );
        getchar();
        return 0; 		// вихід з програми (функції main())
    }
    for ( i = 0; i < N; i ++ )	// якщо файл відкрився успішно -
        if ( EOF == fscanf ( fp, "%d", &a[i] ) ) // по черзі читаємо з нього числа і записуємо в масив, якщо натрапляємо на EOF (кінець файлу) або нечислові дані (не відповідають формату %d, відповідно функція fscanf() повертає кількість вдало зчитаних даних 0) -
        {
            //printf ( "Date is not enough" );
            break;	// виходимо з циклу (завершуємо читання)
        }
    int M = i;
    fclose ( fp ); 			// закриваємо файл
    for ( i = 0; i < M; i ++ )	// опрацьовуємо дані масиву
        a[i] = a[i] * 2;
    fp = fopen ( "output.dat", "w" ); // відкриваємо інший  файл в режимі запису
    for ( i = 0; i < M; i ++ ) 		// по черзі записуємо в нього всі елементи масиву
        fprintf ( fp, "%d ", a[i] ); // в стовпчик (за допомогою \n)
    fclose ( fp );			// закриваємо поточний файл
    return 0;
}
