#include <stdio.h> 
#include <windows.h>
void a (); // прототип функції
void b (); // прототип функції
void c (); //прототип функції
int x = 1; // змінна в області видимості "файл"
 
main()
{
SetConsoleCP(1251);
SetConsoleOutputCP(1251);
int x = 5; // змінна в області видимості "блок" (зовнішній блок функції main())
printf("змінна х в зовнішній області видиомості main() = %d\n", x);
{ // початок нової області видимості (внутрішній блок функції main())
int x = 7;
printf("змінна х у внутрішній області видимості main() = %d\n",x);
} // кінець нової області видимості (внутрішнього блоку функції main())
printf("змінна х в зовнішній області видиомості main() = %d\n",x);
a(); // функція а() має змінну х з власної області видимості "блок"
b(); // функція b() використовує змінну х з області видимості "файл"
c(); // функція c() використовує змінні х з різних областей видимості ("файл" і "блок")
a(); // повторно
b(); // викликаємо
c(); // функції
printf("\n змінна х функції main() = %d\n",x);
}
 
void a()
{
int x = 25; // змінна з областю видимості "блок"
printf("\n змінна х функції а() = %d після входу у функцію", x);
x++; // модифікація змінної внутрішнього рівня
printf("\n змінна х функції а() = %d перед виходом з функції \n",x);
}
 
void b()
{
printf("\n змінна зовнішнього рівня х = %d при вході у функцію b() \n", x);
x *= 10; // модифікація змінної зовнішнього рівня
printf("змінна зовнішнього рівня х = %d при виході з функції b() \n",x);
}
 
void c()
{
printf("\n змінна зовнішнього рівня х =%d при входi у функцію с() \n",x);
x += 15; // модифікація змінної зовнішнього рівня
printf("змінна зовнішнього рівня х = %d після модифікації в с() \n",x);
int x = 77; // початок дії області видимості змінної внутрішнього рівня х
printf("\n змінна внутрішнього рівня х = %d після оголошення в с()",x);
x--; // модифікація змінної внутрішнього рівня
printf("\n змінна внутрішнього рівня х = %d перед виходом з функції с() \n",x);
}


