#include <stdio.h>

int main()
{
	int n, x, y, sum, z;
	FILE *fin, *fout; 	// оголошуємо два покажчики, оскільки одночасно доведеться працювати з двома файлами

	fin = fopen( "input.txt", "r" ); // відкрити файл на читання
	fout = fopen( "output.txt", "w" ); // відкрити файл на запис
    // перевіка на відсутність помилок при відкритті файлів
	while ( 1 ) { 		// цикл до примусового виходу з нього
		n = fscanf ( fin, "%d%d%d", &x, &y, &z );	// зчитуємо з файлу input.dat пару чисел, при цьому фіксуємо кількість вдало зчитаних чисел
		fflush(stdin);
		if ( n < 3 ) break; 	// якщо вдало зчитано менше, ніж 2 числа (кінець файлу або натрапили на некоректні дані) - примусовий вихід з циклу
		fprintf ( fout, "%i %i %i\n", y, x, z ); // результат вносимо у файл output.dat
	}
	fclose ( fout ); // закриваємо
	fclose ( fin );    // обидва файли
	return 0;
}
