#include <stdio.h> // підключення стандартних функцій вводу-виводу

main()
{
	int i; // змінна і - “лічильник” циклу (тип int - ціле число)
	
//	for (i=1;i<=10;i++) // заголовок циклу
	// for ( int i = 1; i <= 10; i ++ ) - допустимо в С++
	for (i=1;i<=10;i++)// - варіант "нескінченного" циклу
	{ 				// початок циклу
		
		printf("Слава Україні! Героям слава!"); // тіло циклу - виведення на екран тексту в дужках
//	i++;
//	if(i>10)break;
	
	} 				// кінець циклу
	getchar(); // функція для затримки програми (очікує натиснення клавіші Enter)
}
